Journal - Down Payment

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sfin="http://sap.com/xi/SAPSCORE/SFIN">
   <soapenv:Header/>
   <soapenv:Body>
      <sfin:JournalEntryBulkCreateRequest>
         <MessageHeader>
            <ID>MSG_2018-07-31</ID>
            <!--<ReferenceID></ReferenceID>-->
            <CreationDateTime>2018-07-18T12:00:00.1234567Z</CreationDateTime>
         </MessageHeader>
         <!--1 or more repetitions:-->
         <JournalEntryCreateRequest>
            <MessageHeader>
               <ID>SUB_MSG_2018-07-18</ID>
               <!--<ReferenceID></ReferenceID>-->	 
               <CreationDateTime>2018-07-18T12:00:00.1234567Z</CreationDateTime>
            </MessageHeader>
            <JournalEntry>
               <OriginalReferenceDocumentType>BKPFF</OriginalReferenceDocumentType>
               <OriginalReferenceDocument/>
               <OriginalReferenceDocumentLogicalSystem/>
               <BusinessTransactionType>RFST</BusinessTransactionType>
               <AccountingDocumentType>KA</AccountingDocumentType>
               <DocumentHeaderText>Test AP Item Posting</DocumentHeaderText>
               <CreatedByUser>003380</CreatedByUser>
               <CompanyCode>1122</CompanyCode>
               <DocumentDate>2019-12-12</DocumentDate>
               <PostingDate>2019-12-12</PostingDate>
               <DocumentReferenceID>123</DocumentReferenceID>
	      <CreditorItem>
                  <ReferenceDocumentItem>2</ReferenceDocumentItem>
		  <BusinessPlace>0001</BusinessPlace>
                  <Creditor>50001743</Creditor>
                  <AmountInTransactionCurrency currencyCode="BRL">-100.00</AmountInTransactionCurrency>
                  <DebitCreditCode>S</DebitCreditCode>
                  <DocumentItemText>Vender Item</DocumentItemText>
                  <AssignmentReference>DOWN PAYMENT</AssignmentReference>
                  <CashDiscountTerms>
                     <DueCalculationBaseDate>2019-11-29</DueCalculationBaseDate>
                     <CashDiscount1Days>0</CashDiscount1Days>
                     <CashDiscount1Percent>0</CashDiscount1Percent>
                     <CashDiscount2Days>0</CashDiscount2Days>
                     <CashDiscount2Percent>0</CashDiscount2Percent>
                     <NetPaymentDays>0</NetPaymentDays>
                  </CashDiscountTerms>
                  <DownPaymentTerms>
                     <SpecialGLCode>A</SpecialGLCode>
                  </DownPaymentTerms>
               </CreditorItem>
            </JournalEntry>
         </JournalEntryCreateRequest>
      </sfin:JournalEntryBulkCreateRequest>
   </soapenv:Body>
</soapenv:Envelope>
